Community-PIO-CH32V/platform-ch32v/misc/svd/CH32V307xx.svd
		<register>
          <name>IPRIOR69</name>
          <displayName>IPRIOR69</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x445</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR70</name>
          <displayName>IPRIOR70</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x446</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR71</name>
          <displayName>IPRIOR71</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x447</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR72</name>
          <displayName>IPRIOR72</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x448</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR73</name>
          <displayName>IPRIOR73</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x449</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR74</name>
          <displayName>IPRIOR74</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR75</name>
          <displayName>IPRIOR75</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR76</name>
          <displayName>IPRIOR76</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR77</name>
          <displayName>IPRIOR77</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR78</name>
          <displayName>IPRIOR78</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR79</name>
          <displayName>IPRIOR79</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR80</name>
          <displayName>IPRIOR80</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x450</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR81</name>
          <displayName>IPRIOR81</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x451</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR82</name>
          <displayName>IPRIOR82</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x452</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR83</name>
          <displayName>IPRIOR83</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x453</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR84</name>
          <displayName>IPRIOR84</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x454</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR85</name>
          <displayName>IPRIOR85</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x455</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR86</name>
          <displayName>IPRIOR86</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x456</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR87</name>
          <displayName>IPRIOR87</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x457</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR88</name>
          <displayName>IPRIOR88</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x458</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR89</name>
          <displayName>IPRIOR89</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x459</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR90</name>
          <displayName>IPRIOR90</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR91</name>
          <displayName>IPRIOR91</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR92</name>
          <displayName>IPRIOR92</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR93</name>
          <displayName>IPRIOR93</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR94</name>
          <displayName>IPRIOR94</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR95</name>
          <displayName>IPRIOR95</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR96</name>
          <displayName>IPRIOR96</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x460</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR97</name>
          <displayName>IPRIOR97</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x461</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR98</name>
          <displayName>IPRIOR98</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x462</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR99</name>
          <displayName>IPRIOR99</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x463</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>	
				<register>
          <name>IPRIOR100</name>
          <displayName>IPRIOR100</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x464</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR101</name>
          <displayName>IPRIOR101</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x465</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR102</name>
          <displayName>IPRIOR102</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x466</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
				<register>
          <name>IPRIOR103</name>
          <displayName>IPRIOR103</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x467</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR104</name>
          <displayName>IPRIOR104</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x468</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR105</name>
          <displayName>IPRIOR105</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x469</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR106</name>
          <displayName>IPRIOR106</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR107</name>
          <displayName>IPRIOR107</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR108</name>
          <displayName>IPRIOR108</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR109</name>
          <displayName>IPRIOR109</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR110</name>
          <displayName>IPRIOR110</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR111</name>
          <displayName>IPRIOR111</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR112</name>
          <displayName>IPRIOR112</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x470</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR113</name>
          <displayName>IPRIOR113</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x471</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR114</name>
          <displayName>IPRIOR114</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x472</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR115</name>
          <displayName>IPRIOR115</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x473</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR116</name>
          <displayName>IPRIOR16</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x474</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR117</name>
          <displayName>IPRIOR17</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x475</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR118</name>
          <displayName>IPRIOR18</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x476</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR119</name>
          <displayName>IPRIOR19</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x477</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR120</name>
          <displayName>IPRIOR120</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x478</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR121</name>
          <displayName>IPRIOR121</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x479</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR122</name>
          <displayName>IPRIOR122</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR123</name>
          <displayName>IPRIOR123</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR124</name>
          <displayName>IPRIOR124</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR125</name>
          <displayName>IPRIOR125</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR126</name>
          <displayName>IPRIOR126</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR127</name>
          <displayName>IPRIOR127</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR128</name>
          <displayName>IPRIOR128</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x480</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR129</name>
          <displayName>IPRIOR129</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x481</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR130</name>
          <displayName>IPRIOR130</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x482</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR131</name>
          <displayName>IPRIOR131</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x483</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR132</name>
          <displayName>IPRIOR132</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x484</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR133</name>
          <displayName>IPRIOR133</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x485</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR134</name>
          <displayName>IPRIOR134</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x486</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR135</name>
          <displayName>IPRIOR135</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x487</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR136</name>
          <displayName>IPRIOR136</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x488</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR137</name>
          <displayName>IPRIOR137</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x489</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR138</name>
          <displayName>IPRIOR138</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR139</name>
          <displayName>IPRIOR139</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
